{
  "nav": {
    "home": "Home",
    "privacy": "Privacy",
    "terms": "Terms",
    "about": "About"
  },
  "footer": {
    "copy": "© 2026 Harmiana",
    "contact": "support@harmiana.com",
    "tagline": "Crafting games worth your time."
  },
  "home": {
    "tagline": "Independent Game Studio",
    "title": "Games that feel as good as they look.",
    "subtitle": "We build tactile puzzle experiences with bold color, satisfying feedback, and deep respect for your time.",
    "badge": "Coming Soon",
    "game": {
      "name": "Crystal Grid",
      "description": "A vibrant block puzzle where color, strategy, and satisfying chain reactions collide. Clear the grid, chase combos, and lose track of time."
    },
    "values": [
      "Every interaction should feel intentional and rewarding.",
      "Simple rules create the deepest mastery.",
      "Your time is valuable — we never waste it."
    ]
  },
  "privacy": {
    "title": "Privacy Policy",
    "body1": "Harmiana does not collect, store, or share personal data. We have no accounts, no tracking, and no analytics that identify you.",
    "body2": "Game data such as your best score and settings are stored locally on your device only. Nothing leaves your phone."
  },
  "terms": {
    "title": "Terms of Service",
    "body1": "Harmiana games are provided \"as is\" without warranties of any kind, express or implied.",
    "body2": "By using the app you agree that use is at your own risk. We reserve the right to update these terms as our games evolve."
  },
  "about": {
    "title": "The Studio",
    "story": "Harmiana is an independent studio built on one conviction: puzzle games deserve the same craft and polish as any other genre. We obsess over the details — the weight of a block snapping into place, the rhythm of a chain reaction, the clarity of a well-designed grid. Every decision serves the player experience.",
    "beliefsTitle": "What We Believe",
    "beliefs": [
      "Feel over flash. A game should be satisfying before it’s pretty.",
      "Depth from simplicity. The best mechanics are learned in seconds and mastered over months.",
      "Respect the player. No dark patterns, no attention traps, no filler."
    ]
  }
}
